from points import *

"""
Массив стартовых и конечных точек для генерации траекторий
"""
traj_array = np.array(
    [
        [61.503549, 23.768187, 61.502962, 23.767478],
        [61.503915, 23.770440, 61.504526, 23.769752]
       # [61.503077, 23.768531, 61.504196, 23.767880],#2
       # [61.501356, 23.767831, 61.501115, 23.769418]#6

        ])
# traj_array = np.array(
#     [
#         [61.501137, 23.767701, 61.500638, 23.767895],
#         [61.504196, 23.767880, 61.503077, 23.768531],
#         # [61.502904, 23.767498, 61.502904, 23.767498],
#         [61.502223, 23.771951, 61.500953, 23.772391],
#         [61.503584, 23.767277, 61.502941, 23.765857],
#         [61.503131, 23.765530, 61.504038, 23.763509],
#         # [61.502309, 23.768458, 61.502309, 23.768458],
#         [61.501356,23.767831, 61.501115,23.769418]
#         [61.504180, 23.769997, 61.504205, 23.769107],
#         [61.503772, 23.771080, 61.503695, 23.769839],
#         [61.503049, 23.771407, 61.502985, 23.770295],
#         [61.503894, 23.765737, 61.504290, 23.764528]
#     ]
#     )
interval = 1  # необходимый интервал между точками
map_number = 1 # номер карты из названия файла, например если map-1.osm, то map_number = 1
senario = 2
# path = Path(Path.home(), 'raytracing progs', 'rx trajectories') # путь для сохранения

# generate_linear_trajectories(path, traj_array, interval, map_number)
generate_linear_trajectories('rx_trajectories', traj_array, interval, map_number, senario)


